In [ ]:
import pandas as pd
import sqlite3
import os

# Connection to Database
db = sqlite3.connect("Titanic.db")

# Read our CSV file (may be redundant)
df = pd.read_csv('titanic.csv', header=None)

# My to.sql call so as to avoid using cursors
df.to_sql("Titanic", db, if_exists="replace")

# This function can be used to insert, select, merge, etc, any data into the created database
def run_query(query):
    return pd.read_sql_query(query, db)

In [ ]:
# Initial SELECT query to see which Table to run queries on
query = """
SELECT *
FROM sqlite_master
"""

run_query(query)

In [ ]:
# Initial SELECT query inside the "Titanic" table
query = """
SELECT *
FROM Titanic
"""

run_query(query)

In [ ]:
# Alter table statements can only be ran one at a time
# These next few queries will change the column names from numbers to their respected data
query = """
ALTER TABLE Titanic RENAME COLUMN "0" TO "Passenger_ID"

"""
run_query(query)

In [ ]:
query = """
ALTER TABLE Titanic RENAME COLUMN "1" TO "Survived"

"""
run_query(query)

In [ ]:
query = """
ALTER TABLE Titanic RENAME COLUMN "3" TO "Passenger_Name"

"""
run_query(query)

In [ ]:
query = """
ALTER TABLE Titanic RENAME COLUMN "4" TO "Passenger_Sex"

"""
run_query(query)

In [ ]:
query = """
ALTER TABLE Titanic RENAME COLUMN "5" TO "Passenger_Age"

"""
run_query(query)

In [ ]:
query = """
ALTER TABLE Titanic RENAME COLUMN "8" TO "Cabin_ID"

"""
run_query(query)

In [ ]:
query = """
ALTER TABLE Titanic RENAME COLUMN "9" TO "Caben_Fare"

"""
run_query(query)

In [ ]:
# Selection to view my work so far
query = """
SELECT * FROM Titanic
"""
run_query(query)

In [ ]:
# Noticing a typo in one of my column names, I ran a new ALTER TABLE statement to fix the typo
query = """
ALTER TABLE Titanic RENAME COLUMN "Caben_Fare" TO "Cabin_Fare"

"""
run_query(query)

In [ ]:
# Selection to view my work so far as well as narrowing down the results to show the columns I'd like to work on
query = """
SELECT Passenger_ID, 
    Survived, 
    Passenger_Name, 
    Passenger_sex, 
    Passenger_age, 
    Cabin_ID, 
    Cabin_Fare
FROM Titanic
"""

run_query(query)

In [ ]:
# This query returns the Sum of all Passengers that survived
query = """
SELECT
    SUM(Survived) AS Survived_The_Titanic
    FROM Titanic
"""

run_query(query)

In [ ]:
# This query returns the amount of men aboard the Titanic
query = """
SELECT
    COUNT(Passenger_Sex)
    AS Total_Number_0f_Men_Aboard
    FROM Titanic
    WHERE Passenger_Sex = "male"
"""

run_query(query)

In [ ]:
# This query returns the amount of men aboard the Titanic
query = """
SELECT
    COUNT(Passenger_Sex)
    AS Total_Number_0f_Women_Aboard
    FROM Titanic
    WHERE Passenger_Sex = "female"
"""

run_query(query)

In [ ]:
# This query returns the amount of men that survived
query = """
SELECT
    COUNT(Passenger_Sex)
    AS Total_Number_Of_Men_Survived
    FROM Titanic
    WHERE Passenger_Sex = "male"
    AND
    Survived = 1
"""

run_query(query)

In [ ]:
# This query returns the amount of women that survived
query = """
SELECT
    COUNT(Passenger_Sex)
    AS Total_Number_Of_Women_Survived
    FROM Titanic
    WHERE Passenger_Sex = "female"
    AND
    Survived = 1
"""

run_query(query)

In [ ]:
# This query returns the rounded average cost of a ticket
query = """
SELECT
    ROUND(AVG(Cabin_fare), 2)
    AS Average_Cabin_fare
    FROM Titanic
"""

run_query(query)

In [ ]:
# This query returns the rounded average age of the passengers
query = """
SELECT
    ROUND(AVG(Passenger_Age), 0)
    AS Average_Passenger_Age
    FROM Titanic
"""

run_query(query)